[
    {
        "text": "I used to think 5 times before eating a $5 meal in Singapore. As a student back in 2014, I did not have much money. It was not as if I was starving or anything. But, I felt massively guilty: burning my parent's money on simple things like food. While, I studied at one of the best MBA programs in the world (on scholarship) Undertaking simple expenses used to hurt. I took 0 trips, attended 0 parties, took close to 0 taxi rides. People talk about: creating 'memories' in your college. But, to create memories you need money. Especially when you are living in an expensive ecosystem. People talk about that they learnt finance, ops at business school. For me, the biggest was: not to give into your FOMO (fear of missing out) Don't act rich, if you are not. The difference between your aspirations and reality = FOMO \n\n***** \n\nFast forward 2025: with hard-work, luck -- things fell in place. And, money got sorted for me. Now, I live in another high expense country (UAE). And, luckily I don't need to check prices of things anymore, before buying. But, to get to this point: I had to avoid almost 2 decades of FOMO. Writing this: because social media today influences you to spend more. Well, should you/should you not? It all depends on how you see life. Simple point remains: spend within your means. As long as you do that, you will be fine. You need to be patient to live a better life. ",
        "engagement": 4164,
        "line_count": 26,
        "language": "English",
        "tags": [
            "Mindset",
            "Financial Discipline"
        ]
    },
    {
        "text": "I had serious confidence issues. Ask me to get up on a stage: I would tremble. If a teacher pointed at me to explain a concept: I would stutter. I was introvert, shy, you can fill all adjectives. Nothing really helped: I read books on building confidence. But, they were filled with generic useless advice: 'like stand tall?' 'speak slowly', really? Seeing confident people around: made me even more nervous. Default reaction was: oh maybe God made me 'this way'. And, I am fine being who I am. \n\nBut, slowly I started to see opportunities fade. Slower promotions, manager's bad review etc. Not because: I was bad at my job. But, because I was under-confident. Something had to be done. So, I started focusing on 1 thing that I could: getting super-skilled at a thing I was already good at. I was good at teaching: so I taught-- I started a GMAT private tutoring business, taught kids English at an NGO, taught my colleagues about investing. Teaching is where I felt at home. \n\nThen YouTube happened: people perceived me as some really confident guy. Well, I am not (still). That flamboyant confidence would never come to me. And, I am okay with it. Ask me to engage in normal chit-chat for 15 minutes: I would not know what to talk to you about. But, ask me to talk about Stock Markets, Macroeconomics, Global Investing, Finance, Consulting: I can do that 5 hours straight without any prep. Not because I am confident -- but, I focused on 1 good skill I had. And, build that overtime. The question never really is: Are you confident? The question really is: What are you confident about?",
        "engagement": 2494,
        "line_count": 17,
        "language": "English",
        "tags": [
            "Motivation",
            "Self Improvement"
        ]
    },
    {
        "text": "We are all gamblers. If a multi trillion $ firm like NVIDIA can fall by almost 20% in 2 days, you gotta understand that we live in a highly speculative world. Everyone around you is gambling: the only difference is whether you are doing it with knowledge or not. \n\n- Idiots are gambling on Dream 11. And losing money, surely. \n- Somewhat smart are investing in Mutual Funds. And are at least beating real inflation \n- Smarter are investing across asset classes, direct stocks, buying undervalued, selling overvalued, optimising for taxes. And, making real money \n\nBut most are working 9-to-9, 'investing' for their hypothetical retirement in FDs, EPF, PF, locking money for long-term (at best at around 8% growth rate on long-term basis) \n\n(the value of which keeps going down, as the government keeps printing more money) \n\nIn 2025, you have no option but to invest in volatile assets. Because the non-speculative ones: don't generate enough returns anymore.",
        "engagement": 2992,
        "line_count": 13,
        "language": "English",
        "tags": [
            "Finance"
        ]
    },
    {
        "text": "Like everyday, I took a metro to work: the line reached from Akshardham Metro station to almost Akshardham Temple. It took me 1.5 hours, just to enter the metro station. This pissed me off. Because I knew when I reach office, I would be bashed by my boss for showing up late (for no fault of mine). I would have to take it. And, show up for work, smiling the next day. And, I did. \n\nThis was 15 years ago. Fast forward: my life turned out different. And, I am deeply thankful for that. But, I haven't forgotten the fact that: my 'past' is the 'current' reality for many. Hence, I teach people about money. That's my motivation for my current work. And, I will continue to do this for my entire life. Because I know: once you have enough of it, you get options. If you are currently struggling in your career: I don't have any golden words for you. You need luck, hard-work and resilience. You will go through your own bitter sweet journey. And, create your own story.",
        "engagement": 1604,
        "line_count": 16,
        "language": "English",
        "tags": [
            "Career",
            "Motivation"
        ]
    },
    {
        "text": "'How long can you stare at your wife?' -- said the L&T Chairman. My wife got serious. And, asked: yeah, tell me: how long, can you? These are one of those questions, where there is no right answer. Say too much, you sound fake. Say too little, you run other risks. This my friend is what scientists call: an impossible question. The poor guy wanted his employees to work for 90-hours-- I don't know. I don't give a rat's behind. But, I wish he would have at least answered the question he started this controversy with. And, not left us hanging.",
        "engagement": 4520,
        "line_count": 7,
        "language": "English",
        "tags": [
            "Relationships",
            "Work Life"
        ]
    },
    {
        "text": "A man looked down from his 125Cr penthouse apartment's posh balcony-- but couldn't believe what he saw: He saw a vegetable vendor sleeping next to his cart. All the potential buyers passing by. 'This is lost business. Such blasphemy' He took his private elevator. And, within 2 minutes, he was next to the poor vendor, trying to wake him up from his deep slumber (literally and figuratively!) Rich guy: 'You ought to work hard!' Vendor: But why? Rich guy: So that you can make money. Vendor: But why? Rich guy: This will move the GDP Vendor: What is GDP? Rich guy: That's besides the point. Leave it. See if you make money you will enjoy life. See my apartment there? top floor? 125Cr! You know how I got there? By WORKING hard! Vendor: But, what's the point of working hard? Rich guy: You get to enjoy great things. Live peacefully. Rest. And, not worry about money. Vendor: I am already enjoying my life. And, I was already resting-- till the point you woke me up to have this conversation. \n\n******* \n\nYou might have already read variants of this story. The point is: to prioritise your present. And, not worry about the future. But, the story presents only half the picture:- Most likely: you would have already made that 125Cr penthouse guy a villian. But, here are the points we would often miss: Let's say we live only in the present: 1) What if your family expands. Who takes care of their expenses? 2) What if you have an emergency. Who takes care of that expense? 3) What if your partner/you need to take a break from work for a few years. How will you manage your household? 4) What if tax in India keeps increasing like Elon Musk's twitter followers, who pays for that? Point is: Greed to constantly earn is bad. Similarly, complacency can be a killer too.",
        "engagement": 2159,
        "line_count": 46,
        "language": "English",
        "tags": [
            "Motivation",
            "Personal Growth"
        ]
    },
    {
        "text": "A job might not make you super rich.\n\nBut, you get paid at a job to build skills that might make you rich one day. \n\nWorld is pretty much how you perceive it. \n\nSome people live as victims, considering they have no options. \n\nSome people are better planned and forward looking. \n\nThey smile through their pain because they have a vision. \n\nStruggle is not really struggle, if you know why you are struggling.",
        "engagement": 4480,
        "line_count": 6,
        "language": "English",
        "tags": [
            "Motivation"
        ]
    },
    {
        "text": "Banks are the best businesses. Because they can force you to upgrade your lifestyle. And, you have close to 0 choice. \n\nHere is a story to prove it:- \n\nI was at the Bengaluru airport yesterday. And this happened:- \n\nCustomer: 'But, 6 months ago: I entered the same Lounge with this same Card, so why can't I do it now?' \n\nLounge employee: Sir, please check with your Bank. \n\nBank: Sir, that was an introductory offer Sir. This card is still valid with XYZ perks. But, to retain your previous benefits you need to avail a new 'upgraded' card. \n\nCustomer: Okay, I am here with my family. My kid wants to go in-- anything you can do? \n\nSorry sir, we have to issue a new card. \n\n**** \n\nWhat do you think happened next? \n\n1) Few years ago, people were really okay with 0 lounge access. It was an 'option' \n\n2) Now, it has transformed into a 'need'. \n\n3) To keep you on the lounge treadmill, you need to upgrade your spend. And, give banks more money. \n\nSo that you get to use a product that you didn't really need in the first place. \n\nFamily & peer pressure, makes it impossible to resist.#Influencer",
        "engagement": 2882,
        "line_count": 24,
        "language": "English",
        "tags": [
            "Influencer"
        ]
    },
    {
        "text": "I used to be fat & happy. \n\nNow, I am thin & happy. \n\nI used to eat junk food\nI still eat junk food, but in balance. \n\nI used to hardly exercise. \nI started exercising, but in balance. \n\nI used to stress about work. \nI still stress about work (sometimes), but in balance. \n\nWith age, comes a little bit of wisdom. \n\nThe wisdom: not to take life too seriously. \nAnd, strive for balance, not perfection.",
        "engagement": 7686,
        "line_count": 11,
        "language": "English",
        "tags": [
            "Wellness",
            "Financial Discipline"
        ]
    },
    {
        "text": "Borrowing money in India is a modern day crime. \n\nIf you wish to preserve your financial health: borrow 0 money. \n\nLet me explain you the logic. \n\nIndia is a high cost of borrowing country. Here:- \n\n- Small businesses struggle to borrow money \n- Poor folks pay 30%+ interest on their loans (loan shark business) \n- The young folks with 0 income are borrowing to buy things like i-Phones \n- Middle class is mortgaging their career (de-facto) for a house \n\nIn 2024: there are more borrowers lining up to 'borrow'. \nAs a result: the demand for 'borrowing' is unprecedented. \n\nThis gives bank an option to jack up the lending rates for end consumers. \n\nEven if you are borrowing to buy a productive asset like a house: you will borrow at 8%-9%, but will get a rental yield at 2-3% (in a metro). \n\nThe remaining 7% deficit you will have to bridge through your future earnings. This is a risky game to play. \n\nOver the years, while the borrowing rates might not have gone up. The return on that borrowing has gone down dramatically. In finance terms this is called as return on capital. \n\nIn economies like Singapore or Dubai: \n- One borrows at 5% \n- Gets a rental yield of 6% \n\nThe rental return on capital is positive, unlike that in India. \n\nNow, I am not here to start a debate. \nThere are many nuances to this argument. \n\n(But, for most people) \n\nAll, I am saying is: people ask-- should I borrow in India? \nThe answer is NO. Avoid as much as possible. \n\nYou only borrow at crazy rates: if you are left with no other option to manage your emergency. \n\n****** \nFollow Wisdom Hatch for more insights on finance.",
        "engagement": 2361,
        "line_count": 34,
        "language": "English",
        "tags": [
            "Finance"
        ]
    }
]